Documents/Лео_ФиксацияСкидокПоТрейдМаркетингу/Лео_ФиксацияСкидокПоТрейдМаркетингу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  <basedOn>Document.Лео_ЗаявкаНаАкцию</basedOn>
  <registerRecords>AccumulationRegister.Лно_СкидкиТрейдМаркетинг</registerRecords>
  <registerRecords>AccumulationRegister.Лео_Скидки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Дистрибьютор</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАктивности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАктивности</name>
    <type>
      <types>CatalogRef.ТипыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВозникновенияРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитБюджетаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержениеФактаПредоставленияСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактаПредоставленияСкидки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокуменПредоставленияСкидки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>String</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопОбъём</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_СостоянияСогласованияДокументов/абс_СостоянияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СостоянияСогласованияДокументов</name>
  <comment>Состояния согласования документов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтап</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДляСогласования</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.Лео_ЗаявкаНаЗапчасти</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_НастройкиНачалаМаршрутовСогласованияДокументов/абс_НастройкиНачалаМаршрутовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиНачалаМаршрутовСогласованияДокументов</name>
  <comment>Настройки начала маршрутов согласования документов</comment>
  <resources>
    <name>МаршрутСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутСогласованияДляЗРССверхЛимита</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутСогласованияСрочныеЗРС</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ТипыДокументовДляСогласования/абс_ТипыДокументовДляСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыДокументовДляСогласования</name>
  <enumValues>
    <name>ВводБюджета</name>
  </enumValues>
  <enumValues>
    <name>СтратегическиеЦелиПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПланПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаБюджетОтделаТМ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРасходованиеСредств</name>
  </enumValues>
  <enumValues>
    <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаОбразцы</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаЗапчасти</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаАкцию</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураПолученный</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ВидыОплатУслугКонтрагентов/абс_ВидыОплатУслугКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОплатУслугКонтрагентов</name>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыКонтрагентов/абс_СтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыКонтрагентов</name>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>НеАктивный</name>
  </enumValues>
  <enumValues>
    <name>Холодный</name>
    <comment>Холодный</comment>
  </enumValues>
  <enumValues>
    <name>Спящий</name>
  </enumValues>
  <enumValues>
    <name>Потенциальный</name>
  </enumValues>
  <enumValues>
    <name>Неликвидный</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>Яндекс</name>
  </enumValues>
</mdclass:Enum>

Catalogs/абс_МаршрутыСогласованияДокументов/абс_МаршрутыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_МаршрутыСогласованияДокументов</name>
  <comment>Маршруты согласования документов</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>СогласованиеДиректором</name>
      <description>Согласование с Генеральным директором </description>
    </items>
    <items>
      <name>СогласованиеПрезидентом</name>
      <description>Согласование с Президентом</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СогласующиеЛица</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Лео_ЛицаСДоступомНаРедактирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Documents/Лео_ФиксацияСкидокПоТрейдМаркетингу/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если Параметры.Ключ.Пустая() или ЭтаФорма.Модифицированность  Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФормуМодально("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаДоработку(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
	ВурнутьНаПервыйЭтап()
КонецПроцедуры

&НаСервере
Процедура ВурнутьНаПервыйЭтап ()
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Объект.Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	
	
	МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
	Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования заявки", Отказ, Заголовок);
		Возврат;
	КонецЕсли;

	НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
	НоваяЗапись.Период 					= ТекущаяДата();
	НоваяЗапись.Активность 				= Истина;
	НоваяЗапись.ДокументДляСогласования = Объект.Ссылка;
	НоваяЗапись.Пользователь 			= Объект.Ответственный;
	НоваяЗапись.Этап 					= МаршрутСогласования;
	НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
	НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
		
	НаборЗаписейСостояниеСогласования.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры


&НаКлиенте
Процедура СкидкиПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Скидки.Итог("СуммаСкидки");
	ОбновитьНадписиИтогов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписиИтогов ()
	//Элементы.СуммаДокумента.Заголовок = "Сумма документа: " + Формат(Объект.СуммаДокумента, "ЧЦ=18; ЧДЦ=2; ЧН=0");	
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	
	Если Объект.ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.ПредоставлениеСкидки Тогда
		Элементы.СтраницаПодтверждение.Доступность = Ложь;
		Объект.ПодтвержениеФактаПредоставленияСкидки = Ложь;
		Объект.ДатаФактаПредоставленияСкидки = Дата("00010101000000");
		Объект.ДокуменПредоставленияСкидки = Неопределено;
	Иначе
		Элементы.СтраницаПодтверждение.Доступность = Истина;
		Объект.ПодтвержениеФактаПредоставленияСкидки = Истина;
	Конецесли

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  Объект.Комментарий = "Не открывать форму" Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		 Объект.Комментарий = "Период ТМА: " + Формат(Объект.ДокументОснование.ДатаНачалаАкции, "ДФ=дд.ММ.гг") + " - " +  Формат(Объект.ДокументОснование.ДатаОкончанияАкции, "ДФ=дд.ММ.гг");
	КонецЕсли;
	
	ЭтапСогласования = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	СостояниеСогласования = Перечисления.СостоянияОбъектов.Подготовлен;
   	ПолучитьРазрешениеНаИзменениеДокументаИзЭтаповСогласования(ЭтапСогласования, СостояниеСогласования);
	
	Если НЕ ЭтапСогласования = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() или не СостояниеСогласования = Перечисления.СостоянияОбъектов.Подготовлен Тогда
	    Если ЭтапСогласования.Лео_ЛицаСДоступомНаРедактирование.Количество()>0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование.Пользователь
				|ИЗ
				|	Справочник.абс_МаршрутыСогласованияДокументов.Лео_ЛицаСДоступомНаРедактирование КАК абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование
				|ГДЕ
				|	абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование.Ссылка = &ЭтапСогласования
				|	И абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование.Пользователь = &Пользователь";

			Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
			Запрос.УстановитьПараметр("ЭтапСогласования", ЭтапСогласования);

			Результат = Запрос.Выполнить();

			СписокПользователей = Результат.Выгрузить();
			Если СписокПользователей.Количество()= 0 Тогда
				ЭтаФорма.Доступность = Ложь;
			Иначе
				ЭтаФорма.Доступность = Истина;
			КонецЕсли;
			//ЭтаФорма.Доступность = Истина;  //Владимир
        КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьРазрешениеНаИзменениеДокументаИзЭтаповСогласования (ЭтапСогласования,СостояниеСогласования)
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние,
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Этап
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
	Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
    	ЭтапСогласования = Выборка.Этап;
		СостояниеСогласования = Выборка.Состояние;
	Иначе
		ЭтапСогласования = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
		СостояниеСогласования = Перечисления.СостоянияОбъектов.Подготовлен; 
	КонецЕсли;

КонецПроцедуры

//Функция определяет маршрут согласования документа по подразделению
Функция ОпределитьМаршрутСогласования(ТипДокументаДляСогласования)   
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования КАК МаршрутСогласования
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования");
	
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, ТипДокументаДляСогласования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Не Объект.Контрагент.Пустая() Тогда
		Если ПроверитьСтатусКонтрагента(Объект.Контрагент) Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();	
			Сообщить ("Контрагент: " + Объект.Контрагент + " в статусе ""Не активный""");
		Конецесли;
	Конецесли;
КонецПроцедуры

&НаСервере
Функция ПроверитьСтатусКонтрагента(Контрагент)
	//{Лео Катанович
	Если ЗначениеЗаполнено(Контрагент.абс_СтатусКонтрагента) Тогда
		Если Контрагент.абс_СтатусКонтрагента <> Перечисления.абс_СтатусыКонтрагентов.Активный Тогда
			Возврат Истина;	
		Иначе
			Возврат Ложь;
		Конецесли;
	Иначе
		 Возврат Истина;
	Конецесли;
	//Лео Катанович}
	
КонецФункции
